CSCI 2021 Concordancer System
Commands:
  add <word>:              adds a new word to concordancer
  query <word>:            queries for a word
  print:                   shows all words currently in the concordancer
  reset:                   resets all word counts to 0 in the concordancer
  load <file_name>:        reads in word list from a file
  save <file_name>:        writes concordancer to a file
  concordance <file_name>: runs a concordance and spell check on the specified file
  exit:                    exits the program
concordance_check> add swan
concordance_check> add hydra
concordance_check> add orchid
concordance_check> add arrow
concordance_check> query orchid
'orchid' present in concordancer
concordance_check> query hydra
'hydra' present in concordancer
concordance_check> query hydra
'hydra' present in concordancer
concordance_check> query swan
'swan' present in concordancer
concordance_check> query hydra
'hydra' present in concordancer
concordance_check> query swan
'swan' present in concordancer
concordance_check> print
hydra 3
swan 2
orchid 1
arrow 0
concordance_check> exit
