CSCI 2021 Concordancer System
Commands:
  add <word>:              adds a new word to concordancer
  query <word>:            queries for a word
  print:                   shows all words currently in the concordancer
  reset:                   resets all word counts to 0 in the concordancer
  load <file_name>:        reads in word list from a file
  save <file_name>:        writes concordancer to a file
  concordance <file_name>: runs a concordance and spell check on the specified file
  exit:                    exits the program
concordance_check> load test_cases/resources/dictionary_large.txt
Word list successfully read from text file
concordance_check> query ivim
'ivim' present in concordancer
concordance_check> query kga
'kga' not found
concordance_check> query lga
'lga' present in concordancer
concordance_check> query nddjfshg
'nddjfshg' present in concordancer
concordance_check> query finalpq
'finalpq' present in concordancer
concordance_check> query hydra
'hydra' not found
concordance_check> query zcmuo
'zcmuo' present in concordancer
concordance_check> query tzmvdot
'tzmvdot' present in concordancer
concordance_check> query swan
'swan' not found
concordance_check> query xafepwir
'xafepwir' present in concordancer
concordance_check> load test_cases/resources/dictionary_medium.txt
Word list successfully read from text file
concordance_check> query ikojvrvxef
'ikojvrvxef' present in concordancer
concordance_check> query luas
'luas' present in concordancer
concordance_check> query ywnf
'ywnf' present in concordancer
concordance_check> query nvmcifyrsz
'nvmcifyrsz' present in concordancer
concordance_check> query vymk
'vymk' present in concordancer
concordance_check> query pearl
'pearl' not found
concordance_check> add pearl
concordance_check> query pearl
'pearl' present in concordancer
concordance_check> exit
