CSCI 2021 Concordancer System
Commands:
  add <word>:              adds a new word to concordancer
  query <word>:            queries for a word
  print:                   shows all words currently in the concordancer
  reset:                   resets all word counts to 0 in the concordancer
  load <file_name>:        reads in word list from a file
  save <file_name>:        writes concordancer to a file
  concordance <file_name>: runs a concordance and spell check on the specified file
  exit:                    exits the program
concordance_check> load test_cases/resources/dictionary_large.txt
Word list successfully read from text file
concordance_check> query xs
'xs' present in concordancer
concordance_check> query xc
'xc' not found
concordance_check> query auhywa
'auhywa' present in concordancer
concordance_check> query ewjfejkl
'ewjfejkl' not found
concordance_check> query xmthajx
'xmthajx' present in concordancer
concordance_check> query asidhvg
'asidhvg' present in concordancer
concordance_check> query tubzthl
'tubzthl' present in concordancer
concordance_check> query fivui
'fivui' present in concordancer
concordance_check> query rye
'rye' present in concordancer
concordance_check> query eye
'eye' not found
concordance_check> query ptohfvvhqi
'ptohfvvhqi' present in concordancer
concordance_check> query lpmqgjlqad
'lpmqgjlqad' present in concordancer
concordance_check> exit
